export const hangulChars = [
  "가",
  "나",
  "다",
  "라",
  "마",
  "바",
  "사",
  "아",
  "자",
  "차",
  "카",
  "타",
  "파",
  "하",
];

export const englishChars = [
  "a",
  "b",
  "c",
  "d",
  "e",
  "f",
  "g",
  "h",
  "i",
  "j",
  "k",
  "l",
  "m",
  "n",
  "o",
  "p",
  "q",
  "r",
  "s",
  "t",
  "u",
  "v",
  "w",
  "x",
  "y",
  "z",
];

export const characters =
  "가각간갈감갑값갓강갖개객갬갭갱갸걀거걱건걸검겁겅겉게겐겔겨격견결겸겹겻경곁계고곡곤곧골곰곱곳공곶과곽관괄광괘괴괵굄굉교구국군굴굼굽굿궁궈권궐궤귀귄규균귤그극근글금급긋긍기긴길김깃깅까깍깐깔깜깝깟깡깨깽꺽껄껌껍껑께꼬꼭꼴꼼꼽꽁꽃꽝꾀꾸꿀꿈꿉꿍꿩꿰뀌끈끌끔끗끝끼끽낌나낙낚난날남납낫낭낮낯낱내냄냅냉냐냠냥너넉넌널넘넛네넥넨넬넷녀녁년념녑녓녕녜노녹논놀놈농뇌뇨뇰뇽누눅눈눌눙뉘뉴뉵늉느늑는늘늠늡늣능늦늪늬니닉닌닐님닙닛닝닢다닥단달닭담답당닻대댁댐댓댕더덕던덜덤덥덧덩덫데덱​덴델뎀뎅도독돈돌돔돗동돛돝되됨두둑둔둘둠둥둬뒈뒤드득든들듬듭듯등디딕딘딜딤딥딩따딱딴딸땀땅때땍땜땡떠떡떤떨떳떵떼떽뗑또똑똘똥뙤뚜뚝뚤뚱뛰뜀뜨뜬뜰뜸뜻띔띠라락란랄람랍랏랑랒래랙랜램랩랫랭랴략랸량러럭런럼레렉렌렐렘렙려력련렬렴렵렷령례롄로록론롤롬롭롯롱뢰료룔룡루룩룬룰룸룹룻룽뤄뤼륄류륙륜률륭르륵른를름릅릇릉릊릎리릭린릴림립릿링마막만말맘맛망맡매맥맨맴맵맷맹​머먹먼멀멈멋멍메멘멜멤멧며멱면멸명몇몌모목몫몬몰몸못몽뫼묘무묵문물뭄뭇뭉뭍뮈뮌뮤므믈미믹민밀밋밍밑바박밖반발밤밥방밭배백밴밸뱀뱃뱅버벅번벌범법벗벙벚베벡벤벨벳벼벽변별볏병볕보복본볼봄봅봇봉봐부북분불붐붓붕붙뷔뷰브블비빅빈빌빔빗빙빚빛빠빡빤빨빵빼뺌뺑뺨뻑뻔뻘뻥뻬뼈뼘뼛뽀뽁뽄뽕뿌뿍뿔뿜삐삥사삭삯산살삵삶삼삽삿상샅새색샘샛생샤샨샬샷샹서석선설섬섭섯성섶세섹센셀셈셉셋셔션셜셰셴셸소속손솔솜솝솟송솥쇄쇠쇼숍숏수숙순술숨숭숯숲숴쉬쉰쉼슈슐슘스슬슴습슷승시식신실심십싯싱싸싹쌀쌈쌍쌤써썩썰썽쎄쏘쏙쏨쏭쏴쑤쑥쑬쑹쒜쓰쓱쓸씀씨씩씬씰씹아악안알암압앗앙앞애액앤앵야약얀얄얌양얘어억언얼​엄업엇엉에엔엘엠여역연열염엽엿영옆예옌오옥온올옴옷옹와왁완왈왕왜외요욕욜용우욱운울움웃웅워원월웡웨웰웹위윈윔윗윙유육윤율융윷으윽은을음읍응의이익인일임입잇잉잎자작잔잘잠잡잣장재잭잴잼쟁저적전절점접젓정젖제젠젤젬젯조족존졸좀좃종좆좌좍좡죄주죽준줄줌중쥐쥔​즈즉즌즐즘즙증지직진질짐집짓징짚짜짝짤짬짱째쨍쩌쩍쩔쩝쩡쩨쪼쪽쫄쫑쭈쭉쭌쭐쭝쯔찌찍찐찔찜찝찡차착찬찰참찹창채책챔챙처척천철첨첩청체첸첼쳐초촉촌촐촘총촬최추축춘출춤충췌취츠측츤층치칙친칠칡침칩칫칭카칵칸칼캄캅캉캐캔캠캡캥컁커컥컨컬컴컵컷컹케켄켈켐켜코콕콘콜콤콧콩콰쾅쾌쾨쿠쿤쿨쿰쿵퀄퀑퀴퀸큐크큰클큼키킥킨킬킴킵킷킹타탁탄탈탐탑탕태택탠탬탭탯탱터턱턴털텀텁텅테텍텐텔템텡톈토톡톤톨톰톱톳통퇴투툭툰툴툼퉁튀튜트특튼틀틈티틱틴틸팀팅파팍판팔팜팝팡팥패팩팬팽퍅퍼퍽펀펄펌펑페펙펜펠펭편폄평폐포폭폰폴폼폿퐁푀표푸푹푼풀품풋풍프플피픽핀필핍핏핑하학한할함합항해핵핸햄행향허헌헐험헛헝헤헨헬헴혀혁현혈혐협형혜호혹혼홀홈홉홍화확환활황홰회획횡효후훅훈훌훔훙훤훨훼휘휠휴휼흉흐흑흔흘흙흠흡흥희히힌힐힘힝";

export function isLowercaseLetter(char: string) {
  return /^[a-z]$/.test(char);
}
